# GetLinkHeightToLayerDeltaZ

## Description
Returns whether or not the wall's height is linked to the layer delta z.

```pascal
FUNCTION GetLinkHeightToLayerDeltaZ(theWall : HANDLE) : BOOLEAN;
```

```python

def vs.GetLinkHeightToLayerDeltaZ(theWall):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|theWall|HANDLE|The wall.|

## See Also
VS Functions:
SetLinkHeightToLayerDeltaZ

## Version
```diff
- GetLinkHeightToLayerDeltaZ is obsolete as of Vectorworks 2012
```

Availability: from VectorWorks12.5
## Category
* Objects - Walls